app/views/cart/_orderables.html.erb

SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ?  [["cart_id", 1]]
---
<% @cart.orderables.each do |orderable| %>