app/views/cart/show.html.erb

SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ?  [["cart_id", 1]]
SELECT 1 AS one FROM "orderables" WHERE "orderables"."cart_id" = ? LIMIT ?  [["cart_id", 2], ["LIMIT", 1]]
---
<h1>Carrinho</h1>
<% if @cart.orderables.empty? %>

SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ?  [["cart_id", 2]]
---
  <div class="order">
    <% @cart.orderables.each do |orderable| %>