app/controllers/cart_controller.rb

  def add
    @product = Product.find_by(id: params[:id])
    quantity = params[:quantity].to_i
    current_orderable = @cart.orderables.find_by(product_id: @product.id)
    if current_orderable && quantity.positive?
      current_orderable.update(quantity:)
      redirect_to cart_path, notice: "O produto foi adicionado ao carrinho!"
    elsif quantity <= 0
      current_orderable.destroy
    else
      @cart.orderables.create(product: @product, quantity:)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ? AND "orderables"."product_id" = ? LIMIT ?  [["cart_id", 1], ["product_id", 1], ["LIMIT", 1]]
UPDATE "orderables" SET "quantity" = ?, "updated_at" = ? WHERE "orderables"."id" = ?  [["quantity", 1], ["updated_at", "2023-08-03 16:35:58.719602"], ["id", 6]]
SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ?  [["cart_id", 1]]
INSERT INTO "orderables" ("product_id", "cart_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 4], ["cart_id", 2], ["quantity", 2], ["created_at", "2023-09-28 01:13:57.647687"], ["updated_at", "2023-09-28 01:13:57.647687"]]

  def checkout
    items = String.new
    @cart.orderables.each do |product|
      items << "%0A*#{product.quantity}*%20#{Product.find_by_id(product.product_id).name}%20R$#{Product.find_by_id(product.product_id).price}%0A"
---
SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ?  [["cart_id", 2]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def remove
    Orderable.find_by(id: params[:id]).destroy
---
DELETE FROM "orderables" WHERE "orderables"."id" = ?  [["id", 1]]
SELECT "orderables".* FROM "orderables" WHERE "orderables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def clear
    Orderable.all.each do |product|
---
SELECT "orderables".* FROM "orderables" ORDER BY "orderables"."id" ASC LIMIT ?  [["LIMIT", 1]]